Project/Toir/src/InformationRegisters/торо_СтатусыДокументовЗаявокУстановленные/торо_СтатусыДокументовЗаявокУстановленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыДокументовЗаявокУстановленные</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ИзменяемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СтатусыРемонтовВЗаявках/торо_СтатусыРемонтовВЗаявках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыРемонтовВЗаявках</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийКСтатусу</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументИсточник</name>
    <type>
      <types>DocumentRef.торо_ЗакрытиеЗаявокИРемонтов</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаНаРемонт</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_СтатусыДокументов/торо_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыДокументов</name>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>ЗапланированоУстранение</name>
  </enumValues>
  <enumValues>
    <name>Устраняется</name>
  </enumValues>
  <enumValues>
    <name>Устранен</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ОтказИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ВозобновленоПослеОтказа</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>ОтказПодразделения</name>
  </enumValues>
  <enumValues>
    <name>гкс_ВыполненНеобходимАктПриемки</name>
  </enumValues>
  <enumValues>
    <name>гкс_Новый</name>
    <comment>TOIR20-673</comment>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/CommonModules/Обмен_mobileBrigades_События/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура Обмен_mobileBrigades_ЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователи") Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Сотрудники.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Сотрудники КАК Сотрудники
		               |ГДЕ
		               |	Сотрудники.ФизическоеЛицо В(&ФизЛицо)";
		
		МассивФизЛиц = Новый Массив;
		Если ЗначениеЗаполнено(Источник.ФизическоеЛицо) Тогда
			МассивФизЛиц.Добавить(Источник.ФизическоеЛицо);
		КонецЕсли;
		Если ЗначениеЗаполнено(Источник.Ссылка)И ЗначениеЗаполнено(Источник.Ссылка.ФизическоеЛицо) Тогда
			МассивФизЛиц.Добавить(Источник.Ссылка.ФизическоеЛицо);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ФизЛицо", МассивФизЛиц);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Ссылка = Выборка.Ссылка;
				ОбъектСотрудник = Ссылка.ПолучитьОбъект();
				ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("mobileBrigades", ОбъектСотрудник, Отказ);
				
				Получатели = Новый Массив;
				Для Каждого Узел Из ОбъектСотрудник.ОбменДанными.Получатели Цикл
					Получатели.Добавить(Узел);
				КонецЦикла;
				
				Если Получатели.Количество() > 0 Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(Получатели, Ссылка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.торо_ТехКартыПрисоединенныеФайлы") Тогда
        УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ТехКарты.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.торо_ТехКарты КАК торо_ТехКарты
		               |ГДЕ
		               |	торо_ТехКарты.Ссылка В(&МассивТехКарт)";
		
		МассивТехКарт = Новый Массив;
		Если ЗначениеЗаполнено(Источник.ВладелецФайла) Тогда
			МассивТехКарт.Добавить(Источник.ВладелецФайла);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("МассивТехКарт", МассивТехКарт);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Ссылка = Выборка.Ссылка;
				ОбъектТехКарта = Ссылка.ПолучитьОбъект();
				ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("mobileBrigades", ОбъектТехКарта, Отказ);
				
				Получатели = Новый Массив;
				Для Каждого Узел Из ОбъектТехКарта.ОбменДанными.Получатели Цикл
					Получатели.Добавить(Узел);
				КонецЦикла;
				
				Если Получатели.Количество() > 0 Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(Получатели, Ссылка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);	
		
	Иначе
		ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("mobileBrigades", Источник, Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура Обмен_mobileBrigades_ЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("mobileBrigades", Источник, Отказ, Замещение);
КонецПроцедуры

Процедура Обмен_mobileBrigades_ЗарегистрироватьИзменениеПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("mobileBrigades", Источник, Отказ);
	
КонецПроцедуры

// Выполняет регистрацию заявок на ремонт, 
// которые должны прийти на устройство всвязи с изменением внешних (по отношению к заявкам)
// параметров: изменение подразделения, назначенного устройству; 
// изменение подразделения-исполнителя в объекте ремонта и др.
Процедура ЗарегистрироватьЗаявкиПриИзмененииПараметров(СтруктураПараметров) Экспорт
	
	Если СтруктураПараметров.Свойство("ИзменениеОР") 
		И СтруктураПараметров.ИзменениеОР = Истина
		И СтруктураПараметров.Свойство("ОбъектРемонта") Тогда
		
		Подразделение = СтруктураПараметров.ОбъектРемонта.ПодразделениеИсполнитель;
		Если ЗначениеЗаполнено(Подразделение) Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	mobileBrigades.Ссылка КАК Ссылка
			|ИЗ
			|	ПланОбмена.mobileBrigades КАК mobileBrigades
			|ГДЕ
			|	mobileBrigades.Подразделение = &Подразделение";
			
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
			
			Получатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			Если Получатели.Количество() > 0 Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Ссылка,
				|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID
				|ПОМЕСТИТЬ ВТ_ДанныеЗаявок
				|ИЗ
				|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
				|ГДЕ
				|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Проведен = ИСТИНА
				|	И торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта = &ОбъектРемонта
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Ссылка,
				|	ID
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних.ИзменяемыйДокумент КАК Документ,
				|	торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних.СтатусДокумента КАК СтатусДокумента
				|ПОМЕСТИТЬ ВТ_СтатусыДокументов
				|ИЗ
				|	РегистрСведений.торо_СтатусыДокументовЗаявокУстановленные.СрезПоследних(
				|			,
				|			ИзменяемыйДокумент В
				|				(ВЫБРАТЬ
				|					ВТ_ДанныеЗаявок.Ссылка КАК Ссылка
				|				ИЗ
				|					ВТ_ДанныеЗаявок КАК ВТ_ДанныеЗаявок)) КАК торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Документ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
				|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ИДРемонта КАК ИДРемонта,
				|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Статус КАК Статус
				|ПОМЕСТИТЬ ВТ_СтатусыРемонтов
				|ИЗ
				|	РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних(
				|			,
				|			(ЗаявкаНаРемонт, ИДРемонта) В
				|				(ВЫБРАТЬ
				|					ВТ_ДанныеЗаявок.Ссылка КАК Ссылка,
				|					ВТ_ДанныеЗаявок.ID КАК ID
				|				ИЗ
				|					ВТ_ДанныеЗаявок КАК ВТ_ДанныеЗаявок)) КАК торо_СтатусыРемонтовВЗаявкахСрезПоследних
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ЗаявкаНаРемонт,
				|	ИДРемонта
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТ_ДанныеЗаявок.Ссылка КАК Ссылка
				|ИЗ
				|	ВТ_ДанныеЗаявок КАК ВТ_ДанныеЗаявок
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыДокументов КАК ВТ_СтатусыДокументов
				|		ПО ВТ_ДанныеЗаявок.Ссылка = ВТ_СтатусыДокументов.Документ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыРемонтов КАК ВТ_СтатусыРемонтов
				|		ПО ВТ_ДанныеЗаявок.Ссылка = ВТ_СтатусыРемонтов.ЗаявкаНаРемонт
				|			И ВТ_ДанныеЗаявок.ID = ВТ_СтатусыРемонтов.ИДРемонта
				|ГДЕ
				|	НЕ ЕСТЬNULL(ВТ_СтатусыРемонтов.Статус, ВТ_СтатусыДокументов.СтатусДокумента) В (&СтатусВыполнен)";
				
				МассивВыполненныхСтатусов = Новый Массив;
				МассивВыполненныхСтатусов.Добавить(Перечисления.торо_СтатусыДокументов.Выполнен);
				МассивВыполненныхСтатусов.Добавить(Перечисления.торо_СтатусыДокументов.Устранен);
				МассивВыполненныхСтатусов.Добавить(Перечисления.торо_СтатусыДокументов.Отклонен);
				
				Запрос.УстановитьПараметр("СтатусВыполнен", МассивВыполненныхСтатусов);
				Запрос.УстановитьПараметр("ОбъектРемонта", СтруктураПараметров.ОбъектРемонта);
				
				ВыборкаЗаявок = Запрос.Выполнить().Выбрать();
				
				Пока ВыборкаЗаявок.Следующий() Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(Получатели, ВыборкаЗаявок.Ссылка);
				КонецЦикла;
				
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Ложь);

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
